
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ЗаполнитьПоУмолчанию();
	Иначе
		ЗаполнитьПоОснованию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчанию()
	
	Объект.Статус 	= Перечисления.рс_СтатусыТехЗаданий.Бэклог;
	Объект.Автор 	= ПараметрыСеанса.ТекущийПользователь; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОснованию()
	
	ЗаполнитьПоУмолчанию();
	
	Если Параметры.Свойство("рс_Объект") Тогда 
		 Объект.рс_Объект = Параметры.рс_Объект;
	КонецЕсли;

	Если Параметры.Свойство("Основание") Тогда 
		 Объект.Основание = Параметры.Основание;
	 КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Содержание 	= Новый ХранилищеЗначения(Чат, Новый СжатиеДанных(9));
	ТекущийОбъект.Описание 		= Новый ХранилищеЗначения(ОписаниеДокумент, Новый СжатиеДанных(9));  

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
     //Элементы.ГруппаСообщения.Видимость = Ложь;
КонецПроцедуры
 
&НаКлиенте
Процедура ДобавитьСообщение(Команда)
	
	Чат.Добавить(, ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	//ДобавитьФорматированныйДокументКФорматированномуДокументу(Чат	,Сообщение);
	
	Чат.Добавить(, ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	//ФС = Новый ФорматированнаяСтрока("ыыы",, Новый Цвет(255,0,0));
	//Чат.Добавить(ФС, ТипЭлементаФорматированногоДокумента.Текст); 
	Чат.Добавить(ПолучитьАвтораИВремя(), ТипЭлементаФорматированногоДокумента.Текст);
	
	//Чат.Добавить(, ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ДобавитьФорматированныйДокументКФорматированномуДокументу(Чат	,Сообщение);
	
	Сообщение.УстановитьФорматированнуюСтроку(Новый ФорматированнаяСтрока(""));
	
	Модифицированность = Истина;   	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Чат = ТекущийОбъект.Содержание.Получить(); 
	
	тОписаниеДокумент 	= ТекущийОбъект.Описание.Получить();
    ОписаниеДокумент 	= тОписаниеДокумент; 

КонецПроцедуры

&НаСервере
Процедура ДобавитьФорматированныйДокументКФорматированномуДокументу(ПриемникДокумент, ДобавляемыйДокумент)

	Для Инд = 0 По ДобавляемыйДокумент.Элементы.Количество() -1 Цикл
		ДобавляемыйЭлемент = ДобавляемыйДокумент.Элементы[Инд];
		Если ТипЗнч(ДобавляемыйЭлемент) = Тип("ПараграфФорматированногоДокумента") Тогда
			НовыйПараграф = ПриемникДокумент.Элементы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйПараграф, ДобавляемыйЭлемент, "ТипПараграфа, ГоризонтальноеПоложение, МеждустрочныйИнтервал,Отступ");
			ДобавитьФорматированныйДокументКФорматированномуДокументу(НовыйПараграф, ДобавляемыйЭлемент);
		Иначе
			Если ТипЗнч(ДобавляемыйЭлемент) = Тип("ТекстФорматированногоДокумента")
				И Не ДобавляемыйЭлемент.Текст = "" Тогда
				НовыйЭлемент = ПриемникДокумент.Элементы.Добавить(ДобавляемыйЭлемент.Текст, Тип("ТекстФорматированногоДокумента"));
				ЗаполнитьЗначенияСвойств(НовыйЭлемент,ДобавляемыйЭлемент,,"ЗакладкаКонца, ЗакладкаНачала, Родитель");
			ИначеЕсли ТипЗнч(ДобавляемыйЭлемент) = Тип("КартинкаФорматированногоДокумента") Тогда
				НовыйЭлемент = ПриемникДокумент.Элементы.Добавить(ДобавляемыйЭлемент.Картинка, Тип("КартинкаФорматированногоДокумента"));
				ЗаполнитьЗначенияСвойств(НовыйЭлемент,ДобавляемыйЭлемент,,"ЗакладкаКонца, ЗакладкаНачала, Родитель");
			ИначеЕсли ТипЗнч(ДобавляемыйЭлемент) = Тип("ПереводСтрокиФорматированногоДокумента") Тогда
				Если ТипЗнч(ДобавляемыйДокумент) = Тип("ПараграфФорматированногоДокумента") 
					И (ДобавляемыйДокумент.ТипПараграфа = ТипПараграфа.МаркированныйСписок
					Или ДобавляемыйДокумент.ТипПараграфа = ТипПараграфа.НумерованныйСписок) Тогда
					Продолжить;
				КонецЕсли;
				НовыйЭлемент = ПриемникДокумент.Элементы.Добавить( , Тип("ПереводСтрокиФорматированногоДокумента"));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьАвтораИВремя()
	
	текстАвторВремя = "";
	
	текПользователь = ПараметрыСеанса.ТекущийПользователь; 
	текстАвторВремя = текПользователь.Наименование + " " + ТекущаяДатаСеанса();
	
	Возврат текстАвторВремя;
	
КонецФункции     

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНаблюдателя(Команда)
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,ЭтаФорма,,,,);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	НоваяСтрока = Объект.Наблюдатели.Добавить();
   	НоваяСтрока.Сотрудник = ВыбранноеЗначение; 
		
	СформироватьСтрокуНаблюдатели(); 
	
	//ДобавитьУведомление(ВыбранноеЗначение);
	
	Модифицированность = Истина;

КонецПроцедуры  

&НаСервере
Процедура СформироватьСтрокуНаблюдатели()
	
   	 УЧС = Новый Массив;
	 Для Каждого СтрНаблюдатель Из Объект.Наблюдатели Цикл  
		 тНаблюдатель = Новый ФорматированнаяСтрока(Строка(СтрНаблюдатель.Сотрудник),,,,ПолучитьНавигационнуюСсылку(СтрНаблюдатель.Сотрудник));
		 УЧС.Добавить(тНаблюдатель);
		 УЧС.Добавить(" ");
	 КонецЦикла;	  
	 
	итСтрокаНаблюдатели = Новый ФорматированнаяСтрока(УЧС); 
	
	СтрокаНаблюдатели	= итСтрокаНаблюдатели;   
	
КонецПроцедуры 

