
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ЗаполнитьПоУмолчанию();
	//ИначеЕсли ЗначениеЗаполнено(Объект.Основание) Тогда
		//ЗаполнитьПоОснованию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчанию()
	
	Объект.Статус 	= Перечисления.рс_СтатусыТехЗаданий.Бэклог;
	Объект.Автор 	= ПараметрыСеанса.ТекущийПользователь; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОснованию()
		
	Если Параметры.Свойство("рс_Объект") Тогда 
		 Объект.рс_Объект = Параметры.рс_Объект;
	КонецЕсли;

	Если Параметры.Свойство("Основание") Тогда 
		 Объект.Основание = Параметры.Основание;
	 КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Описание 		= Новый ХранилищеЗначения(ОписаниеДокумент, Новый СжатиеДанных(9));  

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
     //Элементы.ГруппаСообщения.Видимость = Ложь;
КонецПроцедуры
 
&НаКлиенте
Процедура ДобавитьСообщение(Команда)
	
	ДобавитьСообщение2();
	
	Структура = Новый Структура; 
	Структура.Вставить("Тема", "Добавлен комментарий в ТЗ");  	
	Структура.Вставить("Тело", СформироватьТекстПисьма("Комментарий"));
	
	Получатели = ПолучитьПолучателейОповещения();  
	Структура.Вставить("Получатели", Получатели);
	
	ОтправитьОповещениеНаСервере(Структура);  
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСообщение2()
	
	массивФС = Новый Массив;
	
	ФС 	= ОписаниеДокумент.ПолучитьФорматированнуюСтроку();	
	массивФС.Добавить(ФС); 
	Если ЗначениеЗаполнено(ФС) Тогда 
		массивФС.Добавить(Символы.ПС);
		массивФС.Добавить(Символы.ПС);   
	КонецЕсли;
	
	СтрокаАвтор = Новый ФорматированнаяСтрока(ПолучитьАвтораИВремя(), Новый Шрифт(,,,,Истина,,),,,);
	массивФС.Добавить(СтрокаАвтор); 
	массивФС.Добавить(Символы.ПС);
	
	ФС = Сообщение.ПолучитьФорматированнуюСтроку(); 
	массивФС.Добавить(ФС); 
	массивФС.Добавить(Символы.ПС);
	
	итСтрокаФС 	= Новый ФорматированнаяСтрока(массивФС);
	ОписаниеДокумент.УстановитьФорматированнуюСтроку(итСтрокаФС);
	
	Сообщение.УстановитьФорматированнуюСтроку(Новый ФорматированнаяСтрока(""));
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Чат = ТекущийОбъект.Содержание.Получить(); 
	
	тОписаниеДокумент 	= ТекущийОбъект.Описание.Получить();
    ОписаниеДокумент 	= тОписаниеДокумент; 
	
	СформироватьСтрокуНаблюдатели(); 

КонецПроцедуры

&НаСервере
Процедура ДобавитьФорматированныйДокументКФорматированномуДокументу(ПриемникДокумент, ДобавляемыйДокумент)

	Для Инд = 0 По ДобавляемыйДокумент.Элементы.Количество() -1 Цикл
		ДобавляемыйЭлемент = ДобавляемыйДокумент.Элементы[Инд];
		Если ТипЗнч(ДобавляемыйЭлемент) = Тип("ПараграфФорматированногоДокумента") Тогда
			НовыйПараграф = ПриемникДокумент.Элементы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйПараграф, ДобавляемыйЭлемент, "ТипПараграфа, ГоризонтальноеПоложение, МеждустрочныйИнтервал,Отступ");
			ДобавитьФорматированныйДокументКФорматированномуДокументу(НовыйПараграф, ДобавляемыйЭлемент);
		Иначе
			Если ТипЗнч(ДобавляемыйЭлемент) = Тип("ТекстФорматированногоДокумента")
				И Не ДобавляемыйЭлемент.Текст = "" Тогда
				НовыйЭлемент = ПриемникДокумент.Элементы.Добавить(ДобавляемыйЭлемент.Текст, Тип("ТекстФорматированногоДокумента"));
				ЗаполнитьЗначенияСвойств(НовыйЭлемент,ДобавляемыйЭлемент,,"ЗакладкаКонца, ЗакладкаНачала, Родитель");
			ИначеЕсли ТипЗнч(ДобавляемыйЭлемент) = Тип("КартинкаФорматированногоДокумента") Тогда
				НовыйЭлемент = ПриемникДокумент.Элементы.Добавить(ДобавляемыйЭлемент.Картинка, Тип("КартинкаФорматированногоДокумента"));
				ЗаполнитьЗначенияСвойств(НовыйЭлемент,ДобавляемыйЭлемент,,"ЗакладкаКонца, ЗакладкаНачала, Родитель");
			ИначеЕсли ТипЗнч(ДобавляемыйЭлемент) = Тип("ПереводСтрокиФорматированногоДокумента") Тогда
				Если ТипЗнч(ДобавляемыйДокумент) = Тип("ПараграфФорматированногоДокумента") 
					И (ДобавляемыйДокумент.ТипПараграфа = ТипПараграфа.МаркированныйСписок
					Или ДобавляемыйДокумент.ТипПараграфа = ТипПараграфа.НумерованныйСписок) Тогда
					Продолжить;
				КонецЕсли;
				НовыйЭлемент = ПриемникДокумент.Элементы.Добавить( , Тип("ПереводСтрокиФорматированногоДокумента"));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьАвтораИВремя()
	
	текстАвторВремя = "";
	
	текПользователь = ПараметрыСеанса.ТекущийПользователь; 
	текстАвторВремя = текПользователь.Наименование + " " + ТекущаяДатаСеанса();
	
	Возврат текстАвторВремя;
	
КонецФункции     

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНаблюдателя(Команда)
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,ЭтаФорма,,,,);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	НоваяСтрока = Объект.Наблюдатели.Добавить();
   	НоваяСтрока.Сотрудник = ВыбранноеЗначение; 
		
	СформироватьСтрокуНаблюдатели(); 
	
	//ДобавитьУведомление(ВыбранноеЗначение);
	
	Модифицированность = Истина;

КонецПроцедуры  

&НаСервере
Процедура СформироватьСтрокуНаблюдатели()
	
   	 УЧС = Новый Массив;
	 Для Каждого СтрНаблюдатель Из Объект.Наблюдатели Цикл  
		 тНаблюдатель = Новый ФорматированнаяСтрока(Строка(СтрНаблюдатель.Сотрудник),,,,ПолучитьНавигационнуюСсылку(СтрНаблюдатель.Сотрудник));
		 УЧС.Добавить(тНаблюдатель);
		 УЧС.Добавить(" ");
	 КонецЦикла;	  
	 
	итСтрокаНаблюдатели = Новый ФорматированнаяСтрока(УЧС); 
	
	СтрокаНаблюдатели	= итСтрокаНаблюдатели;   
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьНаблюдателейНаСервере()
	
	Объект.Наблюдатели.Очистить();
	СформироватьСтрокуНаблюдатели();	
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНаблюдателей(Команда)
	ОчиститьНаблюдателейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОснование(Команда)
	ДополнительныеПараметры = Новый Структура;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДополнительныеПоляПередНачаломДобавленияЗавершение", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("ОбщаяФорма.рс_ФормаВыбораОснования",,,,,,ОповещениеОЗакрытии);
КонецПроцедуры

Процедура ДополнительныеПоляПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Объект.Основание = РезультатЗакрытия.Основание;

КонецПроцедуры

&НаКлиенте
Процедура ТолькоЧтение(Команда)
	Если Элементы.ГруппаШапка.Скрыта() Тогда 
		Элементы.ГруппаШапка.Показать();
	Иначе	
		Элементы.ГруппаШапка.Скрыть();
	КонецЕсли;
	Если Элементы.ГруппаСообщение.Скрыта() Тогда 
		Элементы.ГруппаСообщение.Показать();
	Иначе	
		Элементы.ГруппаСообщение.Скрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьОповещениеНаСервере(Структура)
	
	Адрес = "help1c@acons.group"; 
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоРеквизиту("АдресЭлектроннойПочты", Адрес);
    Если УчетнаяЗапись.Пустая() Тогда
        Сообщить("Учётная запись не найдена!");
        Возврат;
	КонецЕсли; 
	
	Почта = ПолучитьСсылкуНаОбъектПочта(УчетнаяЗапись, Истина);
	
	Если Почта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	
	Письмо.Тема = Структура.Тема; 
	
	Для Каждого СтрПолучатели Из Структура.Получатели Цикл 
		Письмо.Получатели.Добавить(СтрПолучатели);
	КонецЦикла;
	Письмо.ИмяОтправителя = "Оповещение";
		
	Текст = Письмо.Тексты.Добавить(Структура.Тело);
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;

	Почта.Послать(Письмо);
    Почта.Отключиться();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаОбъектПочта(УчетнаяЗапись, ТихийРежим = Ложь)
		
	Если НЕ РаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(УчетнаяЗапись,Истина,Ложь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Профиль = УправлениеЭлектроннойПочтойУХ.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	Почта   = Новый ИнтернетПочта;
	
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		
		Если НЕ ТихийРежим Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			СообщениеПользователю.Сообщить();
			Возврат Неопределено;
		КонецЕсли;
		
	КонецПопытки;
	
	Возврат Почта;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьОповещение(Команда) 
	
	Структура = Новый Структура;
	Структура.Вставить("Тема"		, "");  
	Структура.Вставить("ТекстПисьма", "");
	ОтправитьОповещениеНаСервере(Структура);   
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)  
	
	Если  СтатусИзменен() Тогда 
		Структура = Новый Структура; 
		Структура.Вставить("Тема", "Изменен статус ТЗ");  	
		Структура.Вставить("Тело", СформироватьТекстПисьма("Статус"));
		
		Получатели = ПолучитьПолучателейОповещения();  
		Структура.Вставить("Получатели", Получатели);
		
		ОтправитьОповещениеНаСервере(Структура);  
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СформироватьТекстПисьма(Событие)
	текПользователь = ПараметрыСеанса.ТекущийПользователь.Наименование; 
	
	Дополнение 	= "";  
	Заголовок 	= "";
	Если Событие = "Статус" Тогда 
		Дополнение 	= "изменен статуса на " + Объект.Статус; 
		Заголовок 	= "Для технического задания №" + Объект.Код +" "+ """" + Объект.Наименование + """"; 
	ИначеЕсли Событие = "Комментарий" Тогда 
		Дополнение 	= "добавлено сообщение от " + текПользователь; 
		Заголовок 	= "Для технического задания №" + Объект.Код +" "+ """" + Объект.Наименование + """";
	ИначеЕсли Событие = "Новое" Тогда 
		Дополнение = "Добавлено новое техническое задание от " + текПользователь;	
	КонецЕсли;	
		
	Тело = Заголовок; 
	Тело = Тело + "
	|
	| "+ ПолучитьНавигационнуюСсылку(Объект.Ссылка);
	Тело = Тело + "
	|
	|" + Дополнение;

	Возврат Тело;
	
КонецФункции

&НаСервере
Функция СтатусИзменен()
	
	Возврат Не Объект.Ссылка.Статус = Объект.Статус;

КонецФункции

&НаСервере
Функция ПолучитьПолучателейОповещения() 
	
	Массив = Новый Массив;
	АдресЭлПочты = рс_ОбщийМодульСервер.ПолучитьАдресЭлПочты(Объект.Автор);
	Если Не АдресЭлПочты = Неопределено Тогда 
		Массив.Добавить(АдресЭлПочты);
	КонецЕсли;	
	
	АдресЭлПочты = рс_ОбщийМодульСервер.ПолучитьАдресЭлПочты(Объект.Исполнитель);
	Если Не АдресЭлПочты = Неопределено Тогда 
		Массив.Добавить(АдресЭлПочты);
	КонецЕсли;
	
	Для Каждого СтрНаблюдатель Из Объект.Наблюдатели Цикл 
		АдресЭлПочты = рс_ОбщийМодульСервер.ПолучитьАдресЭлПочты(СтрНаблюдатель.Сотрудник);
		Если Не АдресЭлПочты = Неопределено Тогда 
			Массив.Добавить(АдресЭлПочты);
		КонецЕсли;		
	КонецЦикла;	
		
	Возврат Массив;  
	
КонецФункции	 

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда 
	//	Структура = Новый Структура; 
	//	Структура.Вставить("Тема", "Добавлено новое ТЗ");  	
	//	Структура.Вставить("Тело", СформироватьТекстПисьма("Новое"));
	//	
	//	Получатели = ПолучитьПолучателейОповещения();  
	//	Структура.Вставить("Получатели", Получатели);
	//	
	//	ОтправитьОповещениеНаСервере(Структура);  		
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры
