
&НаСервере
Процедура НетИНН_нетКИНаСервере()
	
	Выборка = Справочники.РС_КонтрагентыОбмен.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
		
		СправочникОбъект = Выборка.ПолучитьОбъект();
		СправочникОбъект.Наименование 		= СокрЛП(СправочникОбъект.Наименование);
		СправочникОбъект.НаименованиеПолное = СокрЛП(СправочникОбъект.НаименованиеПолное);
		
		Если Не ЗначениеЗаполнено(Выборка.ИНН) И Выборка.КонтактнаяИнформация.Количество() = 0 Тогда 
			 СправочникОбъект.ПометкаУдаления = Истина;
		КонецЕсли;	
		
		СправочникОбъект.Записать();  
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НетИНН_нетКИ(Команда)
	НетИНН_нетКИНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСправочник2НаСервере()  
	
	//Выборка = Справочники.РС_КонтрагентыОбмен.Выбрать();
	//Пока Выборка.Следующий() Цикл 
	//	Если Выборка.ПометкаУдаления Тогда 
	//		Продолжить; 
	//	КонецЕсли;	    
	//	
	//	//Иттерация 1
	//	//Перенесем только тех и кого заполнен ИНН и КПП, и объеденим таких
	//	Если ЗначениеЗаполнено(Выборка.ИНН) Тогда 
	//		Структура = Новый Структура;   
	//		Структура.Вставить("ИНН"				,Выборка.ИНН);
	//		Структура.Вставить("КПП"				,Выборка.КПП); 
	//		Структура.Вставить("Наименование"		,Выборка.Наименование);
	//		Структура.Вставить("НаименованиеПолное"	,Выборка.НаименованиеПолное);
	//		ПоискКонтрагента = ЕстьВСправочникеКонтрагенты(Структура); 
	//		Если НЕ ЗначениеЗаполнено(ПоискКонтрагента) Тогда 
	//			//ПоискКонтрагента = РС_ОбщийМодульСервер.СоздатьКонтрагентаРС(Структура);
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСправочник2(Команда)
	ЗаполнитьСправочник2НаСервере();
КонецПроцедуры

&НаСервере
Функция ЕстьВСправочникеКонтрагенты(Структура);
	ТекКонтрагент = ПолучитьКотрагентаРС(Структура);
КонецФункции	

&НаСервере
Процедура ПроверитьИНННаСервере()
	
	Выборка = Справочники.РС_КонтрагентыОбмен.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
		
		текИНН = СокрЛП(Выборка.ИНН);
		Если СтрДлина(текИНН) > 12 И Выборка.КонтактнаяИнформация.Количество() = 0 Тогда 
			УстановитьПометкуУдаления(Выборка); 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИНН(Команда)
	ПроверитьИНННаСервере();
КонецПроцедуры

&НаСервере
Процедура ИННСодержитЦифрыНаСервере()
	
	Выборка = Справочники.РС_КонтрагентыОбмен.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ПометкаУдаления Тогда 
			Продолжить; 
		КонецЕсли;
		ПоискЦифр = ИННСодержитНеЦифры(Выборка.ИНН);
		Если ПоискЦифр = 0 Тогда 
			УстановитьПометкуУдаления(Выборка);	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ИННСодержитНеЦифры(ИНН)
	текстЦифры = "1234567890";
	Для к=1 по 12 Цикл
		п = 0;
		текСимвол = Сред(ИНН,к,1);
		п = СтрНайти(текстЦифры, текСимвол);	
	КонецЦикла;
	Возврат п;
КонецФункции

&НаКлиенте
Процедура ИННСодержитЦифры(Команда)
	ИННСодержитЦифрыНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуУдаления(Ссылка)
	СправочникОбъект = Ссылка.ПолучитьОбъект();
	СправочникОбъект.ПометкаУдаления = Истина;
	СправочникОбъект.Записать(); 
КонецПроцедуры

&НаСервере
Процедура Дубли_НаименованиеИННКПП()
	
	Табл.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_КонтрагентыОбмен.Наименование КАК Наименование,
		|	РС_КонтрагентыОбмен.ИНН КАК ИНН,
		|	РС_КонтрагентыОбмен.КПП КАК КПП,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РС_КонтрагентыОбмен.Ссылка) КАК Ссылка
		|ПОМЕСТИТЬ ВТ_контр
		|ИЗ
		|	Справочник.РС_КонтрагентыОбмен КАК РС_КонтрагентыОбмен
		|
		|СГРУППИРОВАТЬ ПО
		|	РС_КонтрагентыОбмен.Наименование,
		|	РС_КонтрагентыОбмен.ИНН,
		|	РС_КонтрагентыОбмен.КПП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_контр.Наименование КАК Наименование,
		|	ВТ_контр.ИНН КАК ИНН,
		|	ВТ_контр.КПП КАК КПП,
		|	ВТ_контр.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_контр КАК ВТ_контр
		|ГДЕ
		|	ВТ_контр.Ссылка > 1";
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Табл.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеИННКПП(Команда)
	НаименованиеИННКППНаСервере();
КонецПроцедуры

&НаСервере
Процедура НаименованиеИННКППНаСервере() 
	
	Для Каждого СтрТаб Из Табл Цикл
		Структура = Новый Структура;
		Структура.Вставить("Наименование"		,СтрТаб.Наименование);
		Структура.Вставить("НаименованиеПолное"	,СтрТаб.НаименованиеПолное);
		Структура.Вставить("ИНН"				,СтрТаб.ИНН);
		Структура.Вставить("КПП"				,СтрТаб.КПП);
		
		ТекКонтрагент = ПолучитьКотрагентаРС(Структура);  
		
		Если ТекКонтрагент = Неопределено Тогда 
			ТекКонтрагент = РС_ОбщийМодульСервер.СоздатьКонтрагентаРС(Структура);	
		КонецЕсли;
		
		КонтрагентОбъект 	= ТекКонтрагент.ПолучитьОбъект(); 
		КонтрагентКИ 		= СтрТаб.Контрагент.КонтактнаяИнформация;
		Для Каждого стрКИ Из КонтрагентКИ Цикл
			Структура.Вставить("Вид"			,стрКИ.Вид);
			Структура.Вставить("Тип"			,стрКИ.Тип);
            Структура.Вставить("Представление"	,стрКИ.Представление);
			Структура.Вставить("Ссылка"			,ТекКонтрагент);
			ПоискКИ = НайтиКИ(Структура);
			Если Не ПоискКИ Тогда 
				НоваяСтрока = КонтрагентОбъект.КонтактнаяИнформация.Добавить();  
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКИ); 
			КонецЕсли;	
		КонецЦикла;
			
		ОбъектКонтрагент = СтрТаб.Контрагент.ПолучитьОбъект(); 
		ОбъектКонтрагент.Обработан = Истина;
		ОбъектКонтрагент.Записать();
		
		КонтрагентОбъект.Записать();
	КонецЦикла;	  
	 
КонецПроцедуры

&НаСервере
Функция ПолучитьКотрагентаОбмен(Структура)
	
	ТекКонтрагент = Неопределено;
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РС_КонтрагентыОбмен.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РС_КонтрагентыОбмен КАК РС_КонтрагентыОбмен
	|ГДЕ
	|	РС_КонтрагентыОбмен.Наименование = &Наименование
	|	И РС_КонтрагентыОбмен.ИНН = &ИНН
	|	И РС_КонтрагентыОбмен.КПП = &КПП";
	
	Запрос.УстановитьПараметр("ИНН"			, Структура.ИНН);
	Запрос.УстановитьПараметр("КПП"			, Структура.КПП);
	Запрос.УстановитьПараметр("Наименование", Структура.Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда  
		Сообщить("!" + Структура.Наименование + ", " + Структура.ИНН + ", " + Структура.КПП);	
	Иначе 	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		  ТекКонтрагент = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТекКонтрагент;
	
КонецФункции

&НаСервере
Функция ПолучитьКотрагентаРС(Структура)
	
	ТекКонтрагент = Неопределено;
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РС_Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РС_Контрагенты КАК РС_Контрагенты
	|ГДЕ
	|	РС_Контрагенты.Наименование = &Наименование
	|	И РС_Контрагенты.ИНН = &ИНН
	|	И РС_Контрагенты.КПП = &КПП";
	
	Запрос.УстановитьПараметр("ИНН"			, Структура.ИНН);
	Запрос.УстановитьПараметр("КПП"			, Структура.КПП);
	Запрос.УстановитьПараметр("Наименование", Структура.Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда  
		//Сообщить("!" + Структура.Наименование + ", " + Структура.ИНН + ", " + Структура.КПП);	
	Иначе 	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		  ТекКонтрагент = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТекКонтрагент;
	
КонецФункции

&НаСервере
Функция НайтиКИ(Структура)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РС_Контрагенты.КонтактнаяИнформация КАК РС_КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	РС_КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка
		|	И РС_КонтрагентыКонтактнаяИнформация.Тип = &Тип
		|	И РС_КонтрагентыКонтактнаяИнформация.Вид = &Вид
		|	И РС_КонтрагентыКонтактнаяИнформация.Представление = &Представление";
	
	Запрос.УстановитьПараметр("Вид"				,Структура.Вид);
	Запрос.УстановитьПараметр("Представление"	,Структура.Представление);
	Запрос.УстановитьПараметр("Ссылка"			,Структура.Ссылка);
	Запрос.УстановитьПараметр("Тип"				,Структура.Тип);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции	

&НаСервере
Процедура КомандаЗаполнитьНаСервере() 
	
	Сч = 1;  	
	Табл.Очистить();
	
	Выборка = Справочники.РС_КонтрагентыОбмен.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ПометкаУдаления Или Выборка.Обработан Тогда 
			Продолжить; 
		КонецЕсли;
		НоваяСтрока = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка); 
		
		НоваяСтрока.Контрагент = Выборка.Ссылка;
		
		Сч = Сч + 1;
		Если Сч =1000 Тогда 
			Прервать;	
		КонецЕсли;		
	КонецЦикла;	 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СпецСимволыНаСервере() 
	
	Для Каждого СтрТаб Из Табл Цикл  
		ПервыйСимвол 	= Лев(СтрТаб.Наименование,1); 
		КС 				= КодСимвола(ПервыйСимвол);		
		Если ПервыйСимвол = Символ(34) 
			ИЛИ ПервыйСимвол = Символ(33)
			ИЛИ ПервыйСимвол = Символ(38) 
			ИЛИ ПервыйСимвол = Символ(42) 
			ИЛИ ПервыйСимвол = Символ(44) 
			ИЛИ ПервыйСимвол = Символ(58) 
			ИЛИ ПервыйСимвол = Символ(8220)  
			ИЛИ ПервыйСимвол = Символ(171)
				Тогда 
			КонтрагентОбъект = СтрТаб.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.Наименование = Сред(КонтрагентОбъект.Наименование,2); 
			КонтрагентОбъект.Записать();
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СпецСимволы(Команда)
	СпецСимволыНаСервере();
КонецПроцедуры

