
&НаКлиенте
Процедура ОК(Команда)
	
	ТекстСообщения = Сообщение.ПолучитьТекст (); 
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("ТекстHTML");
	Результат.Вставить("Вложения");
	
	Сообщение.ПолучитьHTML(Результат.ТекстHTML, Результат.Вложения);
	
	Результат.Вставить("Текст",ТекстСообщения);  
	Результат.Вставить("Сообщение",Сообщение);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Сообщение, Новый УникальныйИдентификатор);
	Результат.Вставить("АдресХранилища",АдресХранилища);
	
	Закрыть(Результат);
	
КонецПроцедуры
