
&НаСервере
Процедура КомандаВыполнитьНаСервере()
	ВыборкаДетальныеЗаписи = РС_ОбщийМодульСервер.ПолучитьВыборкуКонтрагентов();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Наименование"		, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("НаименованиеПолное"	, ВыборкаДетальныеЗаписи.НаименованиеПолное);
		Структура.Вставить("ИНН"				, ВыборкаДетальныеЗаписи.ИНН);
		Структура.Вставить("КПП"				, ВыборкаДетальныеЗаписи.КПП);	
		
		ПараметрыОтчета = Новый Структура;   
		
		ПараметрыОтчета.Вставить("ИНН"							,ВыборкаДетальныеЗаписи.ИНН);
		ПараметрыОтчета.Вставить("ИдентификаторФормы"			,"");
		ПараметрыОтчета.Вставить("Контрагент"					,ВыборкаДетальныеЗаписи.Ссылка);
		ПараметрыОтчета.Вставить("СостояниеОтчета"				,"");
		ПараметрыОтчета.Вставить("СостояниеПроверки"			,"");
		ПараметрыОтчета.Вставить("СостояниеСобытияМониторинга"	,"");   
		ПараметрыОтчета.Вставить("СостояниеФакторыРиска"		,"");
		
		РС_ОбщийМодульСервер.ПроверкаКонтрагентовНаСервере(ПараметрыОтчета); 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	КомандаВыполнитьНаСервере();
КонецПроцедуры
