
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ЗаполнитьПоУмолчанию();
	Иначе
		ЗаполнитьПоОснованию();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
     //Элементы.ГруппаСообщения.Видимость = Ложь;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчанию()
	
	Объект.Статус 	= Перечисления.рс_СтатусыТребований.Новое;
	Объект.Автор 	= ПараметрыСеанса.ТекущийПользователь; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОснованию()
	
	ЗаполнитьПоУмолчанию();
	
	Если Параметры.Свойство("рс_Объект") Тогда 
		 Объект.рс_Объект = Параметры.рс_Объект;
	КонецЕсли;

	Если Параметры.Свойство("Основание") Тогда 
		 Объект.Основание = Параметры.Основание;
	 КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Содержание 	= Новый ХранилищеЗначения(Чат, Новый СжатиеДанных(9));
	ТекущийОбъект.Описание 		= Новый ХранилищеЗначения(ОписаниеДокумент, Новый СжатиеДанных(9));  
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСообщение(Команда)
		
	ДобавитьНовоеСообщение();
	
	Сообщение.УстановитьФорматированнуюСтроку(Новый ФорматированнаяСтрока(""));
	
	Модифицированность = Истина;   
	 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовоеСообщение()
		
	УЧС = Новый Массив;
	УЧС.Добавить(Чат);  
	УЧС.Добавить(Символы.ПС);
	СтрокаАвтор = Новый ФорматированнаяСтрока(ПолучитьАвтораИВремя(), Новый Шрифт(,,,,Истина,,),,,);
	УЧС.Добавить(СтрокаАвтор); 
	УЧС.Добавить(Символы.ПС);
	УЧС.Добавить(Сообщение.ПолучитьТекст());  
	УЧС.Добавить(Символы.ПС); 
		
	итСтрокаУчастники 	= Новый ФорматированнаяСтрока(УЧС);
	Чат 	= итСтрокаУчастники;
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ОснованиеНажатие(Элемент, СтандартнаяОбработка) 
	
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Объект.Основание);   
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка); 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьФорматированныйДокументКФорматированномуДокументу(ПриемникДокумент, ДобавляемыйДокумент) //Не нужна

	Для Инд = 0 По ДобавляемыйДокумент.Элементы.Количество() -1 Цикл
		ДобавляемыйЭлемент = ДобавляемыйДокумент.Элементы[Инд];
		Если ТипЗнч(ДобавляемыйЭлемент) = Тип("ПараграфФорматированногоДокумента") Тогда
			НовыйПараграф = ПриемникДокумент.Элементы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйПараграф, ДобавляемыйЭлемент, "ТипПараграфа, ГоризонтальноеПоложение, МеждустрочныйИнтервал,Отступ");
			ДобавитьФорматированныйДокументКФорматированномуДокументу(НовыйПараграф, ДобавляемыйЭлемент);
		Иначе
			Если ТипЗнч(ДобавляемыйЭлемент) = Тип("ТекстФорматированногоДокумента")
				И Не ДобавляемыйЭлемент.Текст = "" Тогда
				НовыйЭлемент = ПриемникДокумент.Элементы.Добавить(ДобавляемыйЭлемент.Текст, Тип("ТекстФорматированногоДокумента"));
				ЗаполнитьЗначенияСвойств(НовыйЭлемент,ДобавляемыйЭлемент,,"ЗакладкаКонца, ЗакладкаНачала, Родитель");
			ИначеЕсли ТипЗнч(ДобавляемыйЭлемент) = Тип("КартинкаФорматированногоДокумента") Тогда
				НовыйЭлемент = ПриемникДокумент.Элементы.Добавить(ДобавляемыйЭлемент.Картинка, Тип("КартинкаФорматированногоДокумента"));
				ЗаполнитьЗначенияСвойств(НовыйЭлемент,ДобавляемыйЭлемент,,"ЗакладкаКонца, ЗакладкаНачала, Родитель");
			ИначеЕсли ТипЗнч(ДобавляемыйЭлемент) = Тип("ПереводСтрокиФорматированногоДокумента") Тогда
				Если ТипЗнч(ДобавляемыйДокумент) = Тип("ПараграфФорматированногоДокумента") 
					И (ДобавляемыйДокумент.ТипПараграфа = ТипПараграфа.МаркированныйСписок
					Или ДобавляемыйДокумент.ТипПараграфа = ТипПараграфа.НумерованныйСписок) Тогда
					Продолжить;
				КонецЕсли;
				НовыйЭлемент = ПриемникДокумент.Элементы.Добавить( , Тип("ПереводСтрокиФорматированногоДокумента"));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	
	Чат = ТекущийОбъект.Содержание.Получить(); 
	
	тОписаниеДокумент 	= ТекущийОбъект.Описание.Получить();
    ОписаниеДокумент 	= тОписаниеДокумент; 

	СформироватьСтрокуУчастники();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция ПолучитьАвтораИВремя()
	
	текстАвторВремя = "";
	
	текПользователь = ПараметрыСеанса.ТекущийПользователь; 
	текстАвторВремя = текПользователь.Наименование + " " + ТекущаяДатаСеанса();
	
	Возврат текстАвторВремя;
	
КонецФункции	

&НаКлиенте
Процедура ДобавитьУчастника(Команда)
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,ЭтаФорма,,,,);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) 
	
	НоваяСтрока = Объект.Участники.Добавить();
   	НоваяСтрока.Участник = ВыбранноеЗначение; 
		
	СформироватьСтрокуУчастники(); 
	
	ДобавитьУведомление(ВыбранноеЗначение);
	
	Модифицированность = Истина;
	
КонецПроцедуры  

&НаСервере
Процедура СформироватьСтрокуУчастники()
	
   	 УЧС = Новый Массив;
	 Для Каждого СтрУчастник Из Объект.Участники Цикл  
		 тУчастник = Новый ФорматированнаяСтрока(Строка(СтрУчастник.Участник),,,,ПолучитьНавигационнуюСсылку(СтрУчастник.Участник));
		 УЧС.Добавить(тУчастник);
		 УЧС.Добавить(" ");
	 КонецЦикла;	  
	 
	итСтрокаУчастники 	= Новый ФорматированнаяСтрока(УЧС); 
	
	СтрокаУчастники 	= итСтрокаУчастники;   
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьУведомление(Пользователь)
	
	ТекстУведомления = "Вы добавлены как участник для Требование №" + Объект.Ссылка;
	
	СтруктураНапоминания = Новый Структура;
	СтруктураНапоминания.Вставить("Пользователь"				, Пользователь);
	СтруктураНапоминания.Вставить("ВремяСобытия"				, КонецДня(ТекущаяДата())); //Должно быть больще чем текущая дата
	СтруктураНапоминания.Вставить("Источник"					, Объект.Ссылка);
	СтруктураНапоминания.Вставить("ВидСобытияОповещения"		, Справочники.ВидыСобытийОповещений.ДобавленДополнительныйСогласующий); //Обязательно
	СтруктураНапоминания.Вставить("СрокНапоминания"				, НачалоДня(ТекущаяДата())); //Не должно быть пустым и меньше чем текущая дата
	СтруктураНапоминания.Вставить("ИнтервалВремениНапоминания"	, 3600*12);
	СтруктураНапоминания.Вставить("ВремяПоследнегоНапоминания"	, Дата(1,1,1));
	СтруктураНапоминания.Вставить("Описание"					, ТекстУведомления);
	
	МодульУправленияОповещениямиУХ.ДобавитьНапоминаниеПользователяПоСтруктуре(СтруктураНапоминания);  
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУчастников(Команда)
	
	Объект.Участники.Очистить();
	
	СформироватьСтрокуУчастники();
	
	ОчиститьУведомления("Участник"); 
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьУведомления(Роль)
	
	Если Роль = "Участник" Тогда 
		Объект.Участники.Очистить();
		СформироватьСтрокуУчастники();
	КонецЕсли;	
	
	Модифицированность = Истина;
	
КонецПроцедуры	

