
&НаСервере
Процедура КомандаЗаполнитьСправочникНаСервере()
		
	ВыборкаДетальныеЗаписи = РС_ОбщийМодульСервер.ПолучитьВыборкуКонтрагентов();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Наименование"		, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("НаименованиеПолное"	, ВыборкаДетальныеЗаписи.НаименованиеПолное);
		Структура.Вставить("ИНН"				, ВыборкаДетальныеЗаписи.ИНН);
		Структура.Вставить("КПП"				, ВыборкаДетальныеЗаписи.КПП);	
		Структура.Вставить("КонтрагентБД"		, ВыборкаДетальныеЗаписи.Ссылка);
		
		КонтрагентРС = СоздатьКонтрагентаРС(Структура);
				
		//РС_ОбщийМодульСервер.ЗаполнитьОКВЕД2(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);  
		
         //ПараметрыОтчета = Новый Структура;   
		//
		//ПараметрыОтчета.Вставить("ИНН"							,ВыборкаДетальныеЗаписи.ИНН);
		//ПараметрыОтчета.Вставить("ИдентификаторФормы"			,"");
		//ПараметрыОтчета.Вставить("Контрагент"					,ВыборкаДетальныеЗаписи.Ссылка);
		//ПараметрыОтчета.Вставить("СостояниеОтчета"				,"");
		//ПараметрыОтчета.Вставить("СостояниеПроверки"			,"");
		//ПараметрыОтчета.Вставить("СостояниеСобытияМониторинга"	,"");   
		//ПараметрыОтчета.Вставить("СостояниеФакторыРиска"		,"");
		//
		//РС_ОбщийМодульСервер.ПроверкаКонтрагентовНаСервере(ПараметрыОтчета);
				
		РС_ОбщийМодульСервер.ЗаполнитьКИ(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

КонецПроцедуры	

&НаКлиенте
Процедура КомандаЗаполнитьСправочник(Команда)
	КомандаЗаполнитьСправочникНаСервере();
КонецПроцедуры

&НаСервере
Функция СоздатьКонтрагентаРС(Структура)
			
	ПоискКонтрагент = НайтиКонтрагента(Структура);
	
	Если ЗначениеЗаполнено(ПоискКонтрагент) Тогда 
		НовыйЭлемент = ПоискКонтрагент.ПолучитьОбъект();
	Иначе
		НовыйЭлемент = Справочники.РС_КонтрагентыОбмен.СоздатьЭлемент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Структура); 
		
	Ист = Справочники.Организации.ОрганизацияПоУмолчанию(Неопределено);
	
	НовыйЭлемент.Источник = "" + Ист.ИНН + ", " + Ист.Наименование; 
	
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
		
КонецФункции	   

&НаСервере
Функция НайтиКонтрагента(Структура)
	нКонрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	КонтрагентПоИННКПП = НайтиКонтрагентаПоИННКПП(Структура);
	
	Если ЗначениеЗаполнено(КонтрагентПоИННКПП) Тогда 
		нКонрагент = КонтрагентПоИННКПП;	
	Иначе 
		нКонрагент = Справочники.РС_КонтрагентыОбмен.НайтиПоНаименованию(Структура.Наименование);	
	КонецЕсли;

	Возврат нКонрагент;
	
КонецФункции

&НаСервере
Функция НайтиКонтрагентаПоИННКПП(Структура)
	
	нКонрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.РС_Контрагенты КАК РС_Контрагенты
		|ГДЕ
		|	РС_Контрагенты.ИНН = &ИНН
		|	И РС_Контрагенты.КПП = &КПП";
	
	Запрос.УстановитьПараметр("ИНН", Структура.ИНН);
	Запрос.УстановитьПараметр("КПП", Структура.КПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 нКонрагент = ВыборкаДетальныеЗаписи.Контрагент;
	КонецЦикла;
	
	Возврат нКонрагент;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКИНаСервере()
	
	ВыборкаДетальныеЗаписи = РС_ОбщийМодульСервер.ПолучитьВыборкуКонтрагентов();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		Структура = Новый Структура;
		Структура.Вставить("Наименование"		, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("НаименованиеПолное"	, ВыборкаДетальныеЗаписи.НаименованиеПолное);
		Структура.Вставить("ИНН"				, ВыборкаДетальныеЗаписи.ИНН);
		Структура.Вставить("КПП"				, ВыборкаДетальныеЗаписи.КПП);
		
		КонтрагентРС = СоздатьКонтрагентаРС(Структура);
		
		РС_ОбщийМодульСервер.ЗаполнитьКИ(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКИ(Команда)
	ЗаполнитьКИНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОКВЕД2НаСервере()
	
	//Временно
	//ВыборкаДетальныеЗаписи = РС_ОбщийМодульСервер.ПолучитьВыборкуКонтрагентов();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
	//	Структура = Новый Структура;
	//	Структура.Вставить("Наименование"		, ВыборкаДетальныеЗаписи.Наименование);
	//	Структура.Вставить("НаименованиеПолное"	, ВыборкаДетальныеЗаписи.НаименованиеПолное);
	//	Структура.Вставить("ИНН"				, ВыборкаДетальныеЗаписи.ИНН);
	//	Структура.Вставить("КПП"				, ВыборкаДетальныеЗаписи.КПП);
	//	
	//	КонтрагентРС = СоздатьКонтрагентаРС(Структура);
	//	
	//	ПараметрыОтчета = Новый Структура;   
	//	
	//	ПараметрыОтчета.Вставить("ИНН"							,ВыборкаДетальныеЗаписи.ИНН);
	//	ПараметрыОтчета.Вставить("ИдентификаторФормы"			,"");
	//	ПараметрыОтчета.Вставить("Контрагент"					,ВыборкаДетальныеЗаписи.Ссылка);
	//	ПараметрыОтчета.Вставить("СостояниеОтчета"				,"");
	//	ПараметрыОтчета.Вставить("СостояниеПроверки"			,"");
	//	ПараметрыОтчета.Вставить("СостояниеСобытияМониторинга"	,"");   
	//	ПараметрыОтчета.Вставить("СостояниеФакторыРиска"		,"");
	//	
	//	РС_ОбщийМодульСервер.ПроверкаКонтрагентовНаСервере(ПараметрыОтчета);
	//	
	//	РС_ОбщийМодульСервер.ЗаполнитьОКВЕД2(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
	//КонецЦикла;	   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОКВЕД2(Команда)
	ЗаполнитьОКВЕД2НаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработанНаСервере(Массив)
	Для Каждого Стр Из Массив Цикл 
		СпрОбъект = Стр.ПолучитьОбъект();
		СпрОбъект.Обработан = Истина;
		СпрОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Обработан(Команда)
	Массив = Элементы.Список.ВыделенныеСтроки;
	ОбработанНаСервере(Массив);
	Элементы.Список.Обновить();
КонецПроцедуры
