
&НаСервере
Процедура рс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
	ДобавитьСтраницуОбсуждения();
	ДобавитьСтраницуТехЗаданий();
КонецПроцедуры  

&НаСервере
Процедура ДобавитьСтраницуОбсуждения() 
	
	ГрЭлементыСогласования = ЭтотОбъект.Элементы.ЭлементыСогласования;
	
	ПолеВвода_АЛФ = Элементы.Добавить("АС_СтраницаОбсуждения", Тип("ГруппаФормы"), ГрЭлементыСогласования);
	ПолеВвода_АЛФ.Заголовок = "Обсуждения"; 
    ПолеВвода_АЛФ.Вид 		= ВидГруппыФормы.Страница;

	ТаблицаОбъекты = Элементы.Добавить("АС_ТаблицаОбсуждений", Тип("ТаблицаФормы"), ПолеВвода_АЛФ);
	ТаблицаОбъекты.ПутьКДанным = "АС_ТаблицаТребований";
	ТаблицаОбъекты.УстановитьДействие("Выбор", "АС_СтраницаОбсужденийВыбор");
	
	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаОбсужденийСтатус", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Статус";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТребований.Статус";
	
	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаОбсужденийТребование", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Документ";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТребований.Требование";

	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаОбсужденийАвтор", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Автор";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТребований.Автор";
	
	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаОбсужденийИсполнитель", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Исполнитель";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТребований.Исполнитель";
	
	АС_ТаблицаТребований.Параметры.УстановитьЗначениеПараметра("ТекПользователь", ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь"));

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтраницуТехЗаданий() 
	
	ГрЭлементыСогласования = ЭтотОбъект.Элементы.ЭлементыСогласования;
	
	ПолеВвода_АЛФ = Элементы.Добавить("АС_СтраницаТехЗаданий", Тип("ГруппаФормы"), ГрЭлементыСогласования);
	ПолеВвода_АЛФ.Заголовок = "Тех. задания"; 
    ПолеВвода_АЛФ.Вид 		= ВидГруппыФормы.Страница;
	
	ТаблицаОбъекты = Элементы.Добавить("АС_ТаблицаТехЗаданий", Тип("ТаблицаФормы"), ПолеВвода_АЛФ);
	ТаблицаОбъекты.ПутьКДанным = "АС_ТаблицаТехЗаданий";
	ТаблицаОбъекты.УстановитьДействие("Выбор", "АС_СтраницаТехЗаданийВыбор");
	
	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаТехЗаданийРаздел", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Раздел";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТехЗаданий.Раздел";

	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаТехЗаданийДокумент", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Тех. задание";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТехЗаданий.ДокументСсылка";
	
	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаТехЗаданийПриоритет", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Приоритет";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТехЗаданий.Приоритет";
	
	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаТехЗаданийСтатус", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Статус";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТехЗаданий.Статус";
	
	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаТехЗаданийЖелаемаяДатаВыполнения", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Желаемая дата выполнения";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТехЗаданий.ЖелаемаяДатаВыполнения";
	
	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаТехЗаданийАвтор", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Автор";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТехЗаданий.Автор";

	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаТехЗаданийИсполнитель", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Исполнитель";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТехЗаданий.Исполнитель";
	
	АС_ТаблицаТехЗаданий.Параметры.УстановитьЗначениеПараметра("ТекПользователь", ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

&НаКлиенте
Процедура АС_СтраницаОбсужденийВыбор(Элемент)      
	
	ТекСтрока 		= Элементы.АС_ТаблицаОбсуждений.ТекущиеДанные;
	текТребование 	= ТекСтрока.Требование;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", текТребование);
	
	ОткрытьФорму("Справочник.рс_Требование.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура АС_СтраницаТехЗаданийВыбор(Элемент)  
	
	ТекСтрока 	= Элементы.АС_ТаблицаТехЗаданий.ТекущиеДанные;
	текЗадание 	= ТекСтрока.ДокументСсылка;

    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", текЗадание); 
	
	ОткрытьФорму("Справочник.рс_ТехническоеЗадание.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры	
