
&НаСервере
Процедура рс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
	ГрЭлементыСогласования = ЭтотОбъект.Элементы.ЭлементыСогласования;
	
	ПолеВвода_АЛФ = Элементы.Добавить("АС_НоваяСтраница", Тип("ГруппаФормы"), ГрЭлементыСогласования);
	ПолеВвода_АЛФ.Заголовок = "Обсуждения"; 
    ПолеВвода_АЛФ.Вид 		= ВидГруппыФормы.Страница;

	ТаблицаОбъекты = Элементы.Добавить("АС_ТаблицаОбсуждений", Тип("ТаблицаФормы"), ПолеВвода_АЛФ);
	ТаблицаОбъекты.ПутьКДанным = "АС_ТаблицаТребований";
	ТаблицаОбъекты.УстановитьДействие("Выбор", "АС_НоваяСтраницаВыбор");
	
	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаОбсужденийСтатус", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Статус";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТребований.Статус";
	
	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаОбсужденийТребование", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Документ";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТребований.Требование";

	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаОбсужденийАвтор", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Автор";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТребований.Автор";
	
	ЭлементТаблицыФормы = Элементы.Добавить("АС_ТаблицаОбсужденийИсполнитель", Тип("ПолеФормы"), ТаблицаОбъекты);
	ЭлементТаблицыФормы.Заголовок 	= "Исполнитель";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеНадписи;
	ЭлементТаблицыФормы.ПутьКДанным = "АС_ТаблицаТребований.Исполнитель";
	
	АС_ТаблицаТребований.Параметры.УстановитьЗначениеПараметра("ТекПользователь", ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь"));
КонецПроцедуры  

&НаКлиенте
Процедура АС_НоваяСтраницаВыбор(Элемент)      
	
	ТекСтрока 		= Элементы.АС_ТаблицаОбсуждений.ТекущиеДанные;
	текТребование 	= ТекСтрока.Требование;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", текТребование);
	
	ОткрытьФорму("Справочник.рс_Требование.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры  
