
&НаКлиенте
Процедура EF_ТР20688_ОтправитьСсылкуВМахПосле(Команда)
	ПерейтиПоНавигационнойСсылке(СтрокаЗапросаВМах());
КонецПроцедуры

&НаКлиенте
Функция СтрокаЗапросаВМах()
	
	Возврат СтрШаблон("https://max.ru/:share?text=%1%2%3",
		URLСсылкаВКодировке, "%0A", ПредставлениеДокументаВКодировке);
	
КонецФункции

&НаСервере
Процедура EF_ТР20688_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	URLСсылкаВКодировке = КодироватьСтроку(СсылкаДляСкачиванияДокумента, СпособКодированияСтроки.КодировкаURL);
	ПредставлениеДокументаВКодировке = КодироватьСтроку(ПредставлениеДокумента, СпособКодированияСтроки.КодировкаURL);
	
КонецПроцедуры
