
&НаКлиенте
Процедура РС_СписокПриАктивизацииСтрокиПосле(Элемент)
	ТекущиеДанные 		= Элементы.Список.ТекущиеДанные; 
	
	Если Не ТекущиеДанные = Неопределено Тогда 
		ДанныеФайла 		= РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ТекущиеДанные.Ссылка, Неопределено, УникальныйИдентификатор,, АдресДанныхФайла);
		АдресДанныхФайла 	= ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
		Если ДанныеФайла.Расширение	= "pdf" Тогда  
			Элементы.АдресДанныхФайла.Видимость = Ложь;
			Элементы.pdf_Документ.Видимость 	= Истина;			
			ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресДанныхФайла);
			Поток 				= ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения(); 
			Попытка
				ЭтотОбъект.pdf_Документ.Прочитать(Поток);
			Исключение  
				Элементы.pdf_Документ.Видимость 	= Ложь;
				Элементы.АдресДанныхФайла.Видимость = Истина; 
				ПоказатьОповещениеПользователя("Просмотр не доступен",,,БиблиотекаКартинок.Предупреждение);  
			КонецПопытки;
		Иначе
			Элементы.АдресДанныхФайла.Видимость = Истина; 
			Элементы.pdf_Документ.Видимость 	= Ложь;			
			Элементы.АдресДанныхФайла.РазмерКартинки = РазмерКартинки.АвтоРазмер;			
		КонецЕсли;			
	КонецЕсли;

КонецПроцедуры
