
&НаСервере
Процедура ЗаполнитьДополнительныеОКВЭДНаСервере()
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ИНН"							,Объект.ИНН);
	ПараметрыОтчета.Вставить("ИдентификаторФормы"			,"");
	ПараметрыОтчета.Вставить("Контрагент"					,Объект.Ссылка);
	ПараметрыОтчета.Вставить("СостояниеОтчета"				,"");
	ПараметрыОтчета.Вставить("СостояниеПроверки"			,"");
	ПараметрыОтчета.Вставить("СостояниеСобытияМониторинга"	,"");   
	ПараметрыОтчета.Вставить("СостояниеФакторыРиска"		,"");

	РС_ОбщийМодульСервер.ПроверкаКонтрагентовНаСервере(ПараметрыОтчета);
	
	//Если МассивДополнительные.Количество() > 0 Тогда 
	//	Объект.РС_ДополнительныеОКВЭД.Очистить();		
	//	Для Каждого СтрДополнительно Из МассивДополнительные Цикл;
	//		НоваяСтрока = Объект.РС_ДополнительныеОКВЭД.Добавить();
	//		НоваяСтрока.КодОКВЭД 			=  СтрДополнительно.Код;
	//		НоваяСтрока.НаименованиеПолное 	=  СтрДополнительно.Наименование;
	//		
	//		поискОКВЭД2 = Справочники.КлассификаторОКВЭД2.НайтиПоКоду(СтрДополнительно.Код);
	//		
	//		Если Не ЗначениеЗаполнено(поискОКВЭД2) Тогда 
	//			поискОКВЭД2 = РС_ОбщийМодульСервер.ДобавитьЭлементОКВЭД2(СтрДополнительно.Код, СтрДополнительно.Наименование);	
	//		КонецЕсли;
	//		
	//		НоваяСтрока.ОКВЭД2 = поискОКВЭД2;
	//	КонецЦикла;
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДополнительныеОКВЭД(Команда)
	
	ЗаполнитьДополнительныеОКВЭДНаСервере();  
	
	Модифицированность = Истина;  
	
КонецПроцедуры
