
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	ТекущийОбъект.Описание 		= Новый ХранилищеЗначения(ОписаниеДокумент, Новый СжатиеДанных(9));	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОписаниеДокумент 	= ТекущийОбъект.Описание.Получить(); 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Вид) Тогда
		Сообщить("Не заполнен реквизит Вид.");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Индентификатор) Тогда
		Сообщить("Не заполнен реквизит Индентификатор.");
		Возврат;
	КонецЕсли;

	ИмяКоллекции = рс_ОбщийМодульСервер.ИмяКоллекцииМетаданныхПоВиду(Объект.Вид);
	Если Метаданные[ИмяКоллекции] = Неопределено
		Или Метаданные[ИмяКоллекции][Объект.Индентификатор] = Неопределено Тогда
		Сообщить("Метаданные объекта не найдены.");
		Возврат;
	КонецЕсли;

	Объект.рс_Реквизиты.Очистить();
	
	Структура = Новый Структура;
	Структура.Вставить("тВид"	, ИмяКоллекции);
	Структура.Вставить("ИД"		, Объект.Индентификатор);
	Структура.Вставить("Табл"	, Объект.рс_Реквизиты);
	Структура.Вставить("ТЧ"		, Неопределено);
	
	рс_ОбщийМодульСервер.ЗаполнитьРеквизитыРС(Структура);
	
	Для Каждого МетаданноеТЧ Из Метаданные[ИмяКоллекции][Объект.Индентификатор].ТабличныеЧасти Цикл
		ИмяТЧ = МетаданноеТЧ.Имя;
		СсылкаТЧ = Справочники.рс_ТабличныеЧасти.НайтиПоНаименованию(ИмяТЧ);
		Если Не ЗначениеЗаполнено(СсылкаТЧ) Тогда
			СсылкаТЧ = СоздатьТабличнуюЧастьРС(ИмяТЧ);
		КонецЕсли;
		
		Структура.Вставить("ТЧ", СсылкаТЧ);
		рс_ОбщийМодульСервер.ЗаполнитьРеквизитыРС(Структура);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция СоздатьТабличнуюЧастьРС(Знач ИмяТЧ)
	НовыйЭлемент = Справочники.рс_ТабличныеЧасти.СоздатьЭлемент();
	НовыйЭлемент.Наименование = ИмяТЧ;
	НовыйЭлемент.Записать();
	Возврат НовыйЭлемент.Ссылка;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьРеквизиты(Команда)
	ЗаполнитьРеквизитыНаСервере();
КонецПроцедуры
