
Функция СоздатьОбъектРС(Структура)  Экспорт 
	 
	НовОбъект = Справочники.рс_Объекты.СоздатьЭлемент();	
	НовОбъект.Индентификатор 	= Структура.Индентификатор;
	НовОбъект.Наименование  	= Структура.Наименование; 
	НовОбъект.Вид            	= Структура.Вид;

	НовОбъект.Записать();
	
	ЗаполнитьРеквизитыОбъектаРС(НовОбъект.Ссылка);

	Возврат НовОбъект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьРеквизитыОбъектаРС(Ссылка) Экспорт
		
	СпрОбъект = Ссылка.ПолучитьОбъект(); 	
	СпрОбъект.рс_Реквизиты.Очистить(); 
		
	Структура = Новый Структура; 
	Структура.Вставить("тВид"	, Строка(СпрОбъект.Вид));
	Структура.Вставить("ИД"		, СпрОбъект.Индентификатор);
	Структура.Вставить("Табл"	, СпрОбъект.рс_Реквизиты);
	Структура.Вставить("ТЧ"		, Неопределено);
	
	ЗаполнитьРеквизитыРС(Структура); 
	
	//Табличные части
	Для Каждого Метаданное Из Метаданные[Структура.тВид][Структура.ИД].ТабличныеЧасти Цикл 
		ИмяТЧ 		= Метаданное.Имя;
		ТабЧасть 	=  Справочники.рс_ТабличныеЧасти.НайтиПоНаименованию(ИмяТЧ);
		
		Если Не ЗначениеЗаполнено(ТабЧасть) Тогда 
			ТабЧасть = СоздатьРС_ТабличныеЧасти(ИмяТЧ);
		КонецЕсли;
		
		Структура.Вставить("ТЧ"		, ТабЧасть);
		
		ЗаполнитьРеквизитыРС(Структура);
	КонецЦикла;	
	
	//Формы
	Для Каждого Метаданное Из Метаданные[Структура.тВид][Структура.ИД].Формы Цикл
		СпрОбъект.рс_Формы.Очистить();
		НоваяСтрока = СпрОбъект.рс_Формы.Добавить();
		ИмяФормы 	= Метаданное.Имя;
		рсФорма		= Справочники.рс_Формы.НайтиПоНаименованию(ИмяФормы); 
		
		Если Не ЗначениеЗаполнено(рсФорма) Тогда 
			рсФорма = СоздатьРС_Форму(ИмяФормы);
		КонецЕсли;
		
		НоваяСтрока.рс_Форма 	= рсФорма;
	КонецЦикла;
	
	СпрОбъект.Записать();
		
КонецПроцедуры

Функция СоздатьРС_ТабличныеЧасти(ИмяТЧ)
	 СправочникСсылка = Справочники.рс_ТабличныеЧасти.ПустаяСсылка();
	 
	 СправочникОбъект = Справочники.рс_ТабличныеЧасти.СоздатьЭлемент();
	 СправочникОбъект.Наименование = ИмяТЧ;
	 СправочникОбъект.Записать();
	 СправочникСсылка = СправочникОбъект.Ссылка;
	 
	 Возврат СправочникСсылка;
 КонецФункции
 
 Функция СоздатьРС_Форму(ИмяФормы)
	 СправочникСсылка = Справочники.рс_Формы.ПустаяСсылка();
	 
	 СправочникОбъект = Справочники.рс_Формы.СоздатьЭлемент();
	 СправочникОбъект.Наименование = ИмяФормы;
	 СправочникОбъект.Записать();
	 СправочникСсылка = СправочникОбъект.Ссылка;
	 
	 Возврат СправочникСсылка;
 КонецФункции

Процедура ЗаполнитьРеквизитыРС(Структура) Экспорт 

	Для Каждого Метаданное Из Метаданные[Структура.тВид][Структура.ИД].Реквизиты Цикл 
		НовСтрока = Структура.Табл.Добавить(); 
		НовСтрока.Синоним 	= Метаданное.Синоним;
		НовСтрока.Имя 		= Метаданное.Имя;
		
		Если Не Структура.ТЧ = Неопределено Тогда 
			НовСтрока.рс_ТабличнаяЧасть = Структура.ТЧ;
		КонецЕсли;	
		
		ТипыР = Метаданное.Тип.Типы();
		ТипР = "";
		Для Каждого стрТип Из ТипыР Цикл 		
			ПоискТип = Метаданные.НайтиПоТипу(стрТип);
			Если ПоискТип = Неопределено Тогда 
				РеквизитТип 		= Метаданное.Тип;	
			Иначе 	
				ТипР = ТипР + ?(ТипР = "","","; ") + Метаданные.НайтиПоТипу(стрТип).ПолноеИмя();
				РеквизитТип = ТипР;		
			КонецЕсли;
		КонецЦикла;
		
		НовСтрока.Тип 			= РеквизитТип; 		  				
	КонецЦикла;

КонецПроцедуры

Функция НайтиОбъектРС(Вид, Имя) Экспорт
	
	ПоискОбъект = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рс_Объекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.рс_Объекты КАК рс_Объекты
		|ГДЕ
		|	рс_Объекты.Вид = &Вид
		|	И рс_Объекты.Индентификатор = &Имя
		|	И рс_Объекты.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Вид"	, Вид);
	Запрос.УстановитьПараметр("Имя"	, Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПоискОбъект = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат ПоискОбъект;
	
КонецФункции	

