
&НаСервере
Процедура ОтправитьСообщениеНаСервере1()  
	
	Тело = "Для улучшения работы программ 1С, была обновлена платформа,
	|Для дальнейшей работы в программе необходимо скачать и установить новую версию от сюда
	|http://smirnov-roman.ru/podklyuchenie.html"; 
	
	Структура = Новый Структура;
	Структура.Вставить("Тема"		, "Обновление версии 1С");
	Структура.Вставить("Тело"		, Тело);
	
	Получатели = ПолучитьПолучателейОповещения();
	Структура.Вставить("Получатели"	, Получатели);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда) 
	
	Тело = "Для улучшения работы программ 1С, была обновлена платформа,
	|Для дальнейшей работы в программе необходимо скачать и установить новую версию от сюда
	|http://smirnov-roman.ru/podklyuchenie.html"; 
	
	Структура = Новый Структура;
	Структура.Вставить("Тема"		, "Обновление версии 1С");
	Структура.Вставить("Тело"		, Тело);
	
	Получатели = ПолучитьПолучателейОповещения();
	Структура.Вставить("Получатели"	, Получатели);

	ОтправитьОповещениеНаСервере(Структура);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПолучателейОповещения()
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_ЭлектроннаяПочтаДляРассылки.ЭлектроннаяПочта КАК ЭлектроннаяПочта
		|ИЗ
		|	РегистрСведений.РС_ЭлектроннаяПочтаДляРассылки КАК РС_ЭлектроннаяПочтаДляРассылки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Массив.Добавить(ВыборкаДетальныеЗаписи.ЭлектроннаяПочта);
	КонецЦикла;
	
	Возврат Массив;

КонецФункции

Процедура ОтправитьОповещениеНаСервере(Структура)
	
	Адрес = "Smirnovrv@mail.ru"; 

	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоРеквизиту("АдресЭлектроннойПочты", Адрес);

    Если УчетнаяЗапись.Пустая() Тогда
        Сообщить("Учётная запись не найдена!");
        Возврат;
	КонецЕсли; 	

	Почта = ПолучитьСсылкуНаОбъектПочта(УчетнаяЗапись, Истина);
	
	Если Почта = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Письмо = Новый ИнтернетПочтовоеСообщение;	
	Письмо.Тема = Структура.Тема; 

	Для Каждого СтрПолучатели Из Структура.Получатели Цикл 
		Письмо.Получатели.Добавить(СтрПолучатели);
	КонецЦикла;  
	
	Письмо.ИмяОтправителя = "Обновление 1С";

	Текст = Письмо.Тексты.Добавить(Структура.Тело);

	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;

//	Почта.Послать(Письмо);

//    Почта.Отключиться();

КонецПроцедуры


&НаСервере

Функция ПолучитьСсылкуНаОбъектПочта(УчетнаяЗапись, ТихийРежим = Ложь)

	Если НЕ РаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(УчетнаяЗапись,Истина,Ложь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//Профиль = УправлениеЭлектроннойПочтойУХ.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);  
	Профиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(УчетнаяЗапись, Ложь);
	Почта   = Новый ИнтернетПочта;

	Попытка

		Почта.Подключиться(Профиль);

	Исключение		

		Если НЕ ТихийРежим Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			СообщениеПользователю.Сообщить();

			Возврат Неопределено;

		КонецЕсли;

	КонецПопытки;	

	Возврат Почта;

КонецФункции