
&НаСервере
Процедура рс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	рс_ЗаполнитьОбъектМетаданныхНаСервере();
	рс_ДобавитьЭлементыНаФорму();
	
КонецПроцедуры

&НаСервере
Процедура рс_ДобавитьЭлементыНаФорму() 
	
	рс_ДобавитьПолеОбъектМетаданныхНаФорму();  
	рс_ДобавитьМенюТрекерНаФорму();
    рс_ДобавитьКнопкуТребованияНаФорму();
	рс_ДобавитьКнопкуТехЗаданияНаФорму();

КонецПроцедуры	

&НаКлиенте
Процедура рс_ПриОткрытииПосле(Отказ)
	
	рс_РазместитьПолеОбъектМетаданныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура рс_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	рс_ЗаполнитьОбъектМетаданных(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура рс_ЗаполнитьОбъектМетаданныхНаСервере()
	
	рс_ЗаполнитьОбъектМетаданных(Объект);
	
КонецПроцедуры

&НаСервере
Процедура рс_ЗаполнитьОбъектМетаданных(ДокументОбъект)
	
	Если ЗначениеЗаполнено(ДокументОбъект.рс_ОбъектМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств;
	ДокументОбъект.рс_ОбъектМетаданных = рс_ОбщийМодульСервер.ПолучитьОбъектРСПоИмениВИдентификаторах(
		МетаданныеДокумента.Имя,
		МетаданныеДокумента.ПолноеИмя());
	
КонецПроцедуры

&НаСервере
Процедура рс_ДобавитьПолеОбъектМетаданныхНаФорму()
	
	Если Элементы.Найти("рс_ОбъектМетаданных") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = Элементы.Найти("ГруппаОсновноеРеквизиты");
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеФормы = Элементы.Добавить("рс_ОбъектМетаданных", Тип("ПолеФормы"), Родитель);
	ПолеФормы.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеФормы.Вид 					= ВидПоляФормы.ПолеНадписи;
	ПолеФормы.Гиперссылка 			= Истина;
	ПолеФормы.ПутьКДанным 			= "Объект.рс_ОбъектМетаданных";
	ПолеФормы.УстановитьДействие("Нажатие", "рс_ОбъектМетаданныхНажатие");
		
КонецПроцедуры

&НаСервере
Процедура рс_ДобавитьКнопкуТребованияНаФорму() 
	
	Родитель = Элементы.Найти("ГруппаВажныеКоманды");
	
	Команда = Команды.Добавить("рс_ВвестиТребование");
	Команда.Заголовок = "Требование";
	Команда.Действие  = "рс_НовоеТребование"; 
	
	КнопкаФормы = Элементы.Добавить("рс_КнопкаТребование", Тип("КнопкаФормы"), Родитель);
	КнопкаФормы.Заголовок 		= "Требование";
	КнопкаФормы.ИмяКоманды 		= "рс_ВвестиТребование";
	КнопкаФормы.Вид 			= ВидКнопкиФормы.ОбычнаяКнопка; 

КонецПроцедуры

&НаСервере
Процедура рс_ДобавитьКнопкуТехЗаданияНаФорму() 
	
	Родитель = Элементы.Найти("ГруппаВажныеКоманды");
	
	Команда = Команды.Добавить("рс_ВвестиТехническоеЗадание");
	Команда.Заголовок = "Тех. задание";
	Команда.Действие  = "рс_НовоеТехническоеЗадание"; 
	
	КнопкаФормы = Элементы.Добавить("рс_КнопкаТехническоеЗадание", Тип("КнопкаФормы"), Родитель);
	КнопкаФормы.Заголовок 		= "Тех. задание";
	КнопкаФормы.ИмяКоманды 		= "рс_ВвестиТехническоеЗадание";
	КнопкаФормы.Вид 			= ВидКнопкиФормы.ОбычнаяКнопка; 

КонецПроцедуры

&НаСервере
Процедура рс_ДобавитьМенюТрекерНаФорму() 
	
	Родитель 					= Элементы.Найти("ГруппаВажныеКоманды");
    ТекущееПодменю 				= Элементы.Добавить("рсГруппаДополнительно", Тип("ГруппаФормы"), Родитель);
	ТекущееПодменю.Заголовок 	= "Дополнительно (АС)";
	ТекущееПодменю.Вид 			= ВидГруппыФормы.Подменю;
	
	Команда = Команды.Добавить("рс_ТребованияСписок");
	Команда.Заголовок = "Требования";
	Команда.Действие  = "рс_ОткрытьСписокТребований";  
	
	КнопкаФормы = Элементы.Добавить("рс_Требование", Тип("КнопкаФормы"), ТекущееПодменю);
	КнопкаФормы.Заголовок 		= "Требования";
	КнопкаФормы.ИмяКоманды 		= "рс_ТребованияСписок";
	КнопкаФормы.Вид 			= ВидКнопкиФормы.ОбычнаяКнопка; 
	
	Команда = Команды.Добавить("рс_ТехническоеЗаданиеСписок");
	Команда.Заголовок 			= "Технические Задания";
	Команда.Действие  			= "рс_ОткрытьСписокТехническихЗаданий";  
	
	КнопкаФормы = Элементы.Добавить("рс_ТехническиеЗадания", Тип("КнопкаФормы"), ТекущееПодменю);
	КнопкаФормы.Заголовок 		= "Технические Задания";
	КнопкаФормы.ИмяКоманды 		= "рс_ТехническоеЗаданиеСписок";
	КнопкаФормы.Вид 			= ВидКнопкиФормы.ОбычнаяКнопка; 

КонецПроцедуры

&НаСервере
Процедура рс_РазместитьПолеОбъектМетаданныхНаСервере()
	
	ПолеФормы = Элементы.Найти("рс_ОбъектМетаданных");
	Если ПолеФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = Элементы.Найти("Группа_ДатаНомер"); 
	
	рс_РазместитьПолеПодДатаНомер(ПолеФормы, Родитель);
	
КонецПроцедуры

&НаСервере
Процедура рс_РазместитьПолеПодДатаНомер(ПолеФормы, Родитель)
		
	Элементы.Переместить(ПолеФормы, Родитель);
	
КонецПроцедуры

&НаКлиенте
Процедура рс_ОбъектМетаданныхНажатие(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.рс_ОбъектМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, Объект.рс_ОбъектМетаданных);
	
КонецПроцедуры

&НаКлиенте
Процедура рс_ОткрытьСписокТребований(Команда)
	ОткрытьФорму("Справочник.рс_Требование.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура рс_НовоеТребование (Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("рс_Объект", Объект.рс_ОбъектМетаданных);
    ПараметрыФормы.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.рс_Требование.ФормаОбъекта",ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура рс_НовоеТехническоеЗадание(Команда)    
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("рс_Объект", Объект.рс_ОбъектМетаданных);
    ПараметрыФормы.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.рс_ТехническоеЗадание.ФормаОбъекта",ПараметрыФормы); 
	
КонецПроцедуры

&НаКлиенте
Процедура рс_ОткрытьСписокТехническихЗаданий(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("рс_Объект", Объект.рс_ОбъектМетаданных);
    ПараметрыФормы.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.рс_ТехническоеЗадание.ФормаСписка");
	
КонецПроцедуры
