
&НаСервере
Процедура РС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ГруппаКолонок_НГ1 = Элементы.Вставить("ГруппаОКПД2", Тип("ГруппаФормы"),, );
	ГруппаКолонок_НГ1.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКолонок_НГ1.Заголовок 			= "ОКПД2";
	ГруппаКолонок_НГ1.Поведение 			= ПоведениеОбычнойГруппы.Свертываемая; 
	ГруппаКолонок_НГ1.ШрифтЗаголовка 		= Новый Шрифт(, 10);
	ГруппаКолонок_НГ1.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка; 
	ГруппаКолонок_НГ1.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаКолонок_НГ1.Скрыть();
	
	ТаблицаОКПД2 = Элементы.Добавить("ОКПД2", Тип("ТаблицаФормы"), ГруппаКолонок_НГ1);
	ТаблицаОКПД2.ПутьКДанным = "Объект.РС_ОКПД2";
	ТаблицаОКПД2.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	
	ЭлементТаблицыФормы = Элементы.Добавить("ОКПД2НомерСтроки", Тип("ПолеФормы"), ТаблицаОКПД2);
	ЭлементТаблицыФормы.Заголовок 	= "N";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РС_ОКПД2.НомерСтроки";

	ЭлементТаблицыФормы = Элементы.Добавить("ОКПД2КодОКПД2", Тип("ПолеФормы"), ТаблицаОКПД2);
	ЭлементТаблицыФормы.Заголовок 	= "Код ОКПД2";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РС_ОКПД2.ОКПД2"; 
	
	КомандаФормы = Команды.Добавить("ЗаполнитьОКПД2");
	КомандаФормы.Заголовок = "Заполнить ОКПД2";
	КомандаФормы.Действие  = "ЗаполнитьОКПД2";

	КнопкаФормы = Элементы.Добавить("КомандаЗаполнитьОКПД2", Тип("КнопкаФормы"), Элементы.ОКПД2.КоманднаяПанель);
	КнопкаФормы.ИмяКоманды = "ЗаполнитьОКПД2";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОКПД2(Команда)

	  ЗаполнитьОКПД2наСервере(); 
	  
	  Модифицированность = Истина;
	  
  КонецПроцедуры 
  
&НаСервере
Процедура ЗаполнитьОКПД2наСервере()
        //технический долг
КонецПроцедуры