&НаСервере
Процедура КомандаЗаполнитьСправочникНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактныеЛица.Ссылка КАК Ссылка,
		|	КонтактныеЛица.Наименование КАК Наименование,
		|	КонтактныеЛица.Фамилия КАК Фамилия,
		|	КонтактныеЛица.Имя КАК Имя,
		|	КонтактныеЛица.Отчество КАК Отчество,
		|	КонтактныеЛица.ДатаРождения КАК ДатаРождения,
		|	КонтактныеЛица.ОбъектВладелец КАК КонтрагентБД
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.ОбъектВладелец ССЫЛКА Справочник.Контрагенты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Наименование"	, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("Фамилия"		, ВыборкаДетальныеЗаписи.Фамилия);
		Структура.Вставить("Имя"			, ВыборкаДетальныеЗаписи.Имя);
		Структура.Вставить("Отчество"		, ВыборкаДетальныеЗаписи.Отчество);
		Структура.Вставить("ДатаРождения"	, ВыборкаДетальныеЗаписи.ДатаРождения);
		Структура.Вставить("КонтрагентБД"	, ВыборкаДетальныеЗаписи.КонтрагентБД);
		
		КонтактноеЛицоРС = СоздатьКонтактноеЛицоРС(Структура); 
		
		РС_ОбщийМодульСервер.ЗаполнитьКИ(КонтактноеЛицоРС, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСправочник(Команда)
	КомандаЗаполнитьСправочникНаСервере();
КонецПроцедуры

&НаСервере
Функция СоздатьКонтактноеЛицоРС(Структура)
			
	ПоискКЛ = НайтиКонтактноеЛицо(Структура);
	
	Если ЗначениеЗаполнено(ПоискКЛ) Тогда 
		НовыйЭлемент = ПоискКЛ.ПолучитьОбъект();
	Иначе
		НовыйЭлемент = Справочники.РС_КонтактныеЛица.СоздатьЭлемент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Структура);
	
	Ист = Справочники.Организации.ОрганизацияПоУмолчанию(Неопределено);
	
	НовыйЭлемент.Источник = "" + Ист.ИНН + ", " + Ист.Наименование; 
	
	НовыйЭлемент.Контрагент = Справочники.РС_КонтрагентыОбмен.НайтиПоРеквизиту("КонтрагентБД", Структура.КонтрагентБД);
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции  

&НаСервере
Функция НайтиКонтактноеЛицо(Структура)
	
	ПоискКЛ = Справочники.РС_КонтактныеЛица.ПустаяСсылка();  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_КонтактныеЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РС_КонтактныеЛица КАК РС_КонтактныеЛица
		|ГДЕ
		|	РС_КонтактныеЛица.КонтрагентБД = &КонтрагентБД
		|	И РС_КонтактныеЛица.Имя = &Имя
		|	И РС_КонтактныеЛица.Фамилия = &Фамилия
		|	И РС_КонтактныеЛица.Отчество = &Отчество
		|	И РС_КонтактныеЛица.ДатаРождения = &ДатаРождения";
	
	Запрос.УстановитьПараметр("ДатаРождения", Структура.ДатаРождения);
	Запрос.УстановитьПараметр("Имя"			, Структура.Имя);
	Запрос.УстановитьПараметр("КонтрагентБД", Структура.КонтрагентБД);
	Запрос.УстановитьПараметр("Отчество"	, Структура.Отчество);
	Запрос.УстановитьПараметр("Фамилия"		, Структура.Фамилия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПоискКЛ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	 
	 Возврат ПоискКЛ;
	
КонецФункции

&НаСервере
Процедура Команда1НаСервере()
	
	Выборка = Справочники.РС_КонтактныеЛица.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.КонтактнаяИнформация.Количество() = 0 Тогда 
			СправочникОбъект = Выборка.ПолучитьОбъект();
			СправочникОбъект.НетКИ = Истина;
			СправочникОбъект.Записать();
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаСокрЛПНаСервере() 
	
	Выборка = Справочники.РС_КонтактныеЛица.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Тогда 
			Продолжить;	
		КонецЕсли;		
		СправочникОбъект = Выборка.ПолучитьОбъект();
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование);
		СправочникОбъект.Записать();		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСокрЛП(Команда)
	КомандаСокрЛПНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПеренестиВФЛНаСервере(Массив)
	Для Каждого СтрМассива Из Массив Цикл
		СоздатьФизЛицоРС(СтрМассива);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВФЛ(Команда) 
	Массив = Элементы.Список.ВыделенныеСтроки;
	ПеренестиВФЛНаСервере(Массив);
КонецПроцедуры

 &НаСервере
Процедура СоздатьФизЛицоРС(СтрМассива)
	 
	 Если ЗначениеЗаполнено(СтрМассива.Источник) Тогда 
		 Источник =  СтрМассива.Источник;
	 Иначе	 
		 Источник = РС_ОбщийМодульСервер.СоздатьИсточникЭтаБаза();
	 КонецЕсли;
	 
	 Структура = Новый Структура;
	 Структура.Вставить("ДатаРождения"	,СтрМассива.ДатаРождения);
	 Структура.Вставить("Имя"			,СтрМассива.Имя);
	 Структура.Вставить("ИНН"			,"");
	 Структура.Вставить("Отчество"		,СтрМассива.Отчество);
	 Структура.Вставить("Фамилия"		,СтрМассива.Фамилия); 
	 Структура.Вставить("Источник"		,Источник);
	 Структура.Вставить("Контрагент"	,СтрМассива.Контрагент.Наименование);
	  
	 ПоискФЛ = РС_ОбщийМодульСервер.НайтиФизЛицо(Структура);
	 
	 Если Не ЗначениеЗаполнено(ПоискФЛ) Тогда 
		 НовыйЭлемент = Справочники.РС_ФизическиеЛица.СоздатьЭлемент(); 
		 НовыйЭлемент.ДатаРождения 	= СтрМассива.ДатаРождения;
		 НовыйЭлемент.Имя 	  		= СтрМассива.Имя; 
		 НовыйЭлемент.Источник      = Источник;
		 НовыйЭлемент.Наименование  = СтрМассива.Наименование;
		 НовыйЭлемент.НетКИ         = СтрМассива.НетКИ;
		 НовыйЭлемент.Отчество 		= СтрМассива.Отчество; 
		 Если ЗначениеЗаполнено(СтрМассива.Фамилия) Тогда 
			 Фамилия       = СтрМассива.Фамилия;
		 Иначе
			 Фамилия       = СтрМассива.Контрагент.Наименование;
		 КонецЕсли;
		 НовыйЭлемент.Фамилия       = Фамилия; 
		 НовыйЭлемент.ФИО = СокрЛП(Фамилия) + " " + СокрЛП(СтрМассива.Имя) + " " + СокрЛП(СтрМассива.Отчество);
		 
		 НовыйЭлемент.Записать();
		 
		 ПоискФЛ = НовыйЭлемент.Ссылка;
		 
		 Для Каждого СтрКИ Из СтрМассива.КонтактнаяИнформация Цикл 
			 
			 НовяСтрока = НовыйЭлемент.КонтактнаяИнформация.Добавить();
			 ЗаполнитьЗначенияСвойств(НовяСтрока, СтрКИ);
			 
			 Если ЗначениеЗаполнено(СтрМассива.Контрагент) Тогда 
				 СпрКонтрагентОбъект 	= СтрМассива.Контрагент.ПолучитьОбъект(); 
				 НовяСтрокаКонт 		= СпрКонтрагентОбъект.КонтактнаяИнформация.Добавить(); 
				 ЗаполнитьЗначенияСвойств(НовяСтрокаКонт, СтрКИ);
				 НовяСтрокаКонт.КонтактноеЛицо = ПоискФЛ; 
				 СпрКонтрагентОбъект.Записать();
			 КонецЕсли;
			 
		 КонецЦикла;
		 
		 НовыйЭлемент.Записать();      
		 
	 КонецЕсли;
	 
 КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФИОНаСервере(Массив)
	 
	 Для Каждого СтрМассива Из Массив Цикл
		МассивСтроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрМассива.Наименование, " "); 		
		Если МассивСтроки.Количество() > 0 Тогда 
			СправочникОбъект  = СтрМассива.Ссылка.ПолучитьОбъект();
			Если МассивСтроки.Количество() >= 3 Тогда  				
				СправочникОбъект.Фамилия 	= МассивСтроки[0];
				СправочникОбъект.Имя 		= МассивСтроки[1];
				СправочникОбъект.Отчество 	= МассивСтроки[2];
			ИначеЕсли МассивСтроки.Количество() = 2 Тогда 
				СправочникОбъект.Фамилия 	= МассивСтроки[1];
				СправочникОбъект.Имя 		= МассивСтроки[0];
			ИначеЕсли МассивСтроки.Количество() = 1 Тогда 
				СправочникОбъект.Имя 		= МассивСтроки[0];
			Иначе 	
				Сообщить(СтрМассива.Наименование);
			КонецЕсли;
			СправочникОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
 КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФИО(Команда) 
	Массив = Элементы.Список.ВыделенныеСтроки;
	 ЗаполнитьФИОНаСервере(Массив);
 КонецПроцедуры

 &НаСервере
 Процедура УстановитьТолькоАдресНаСервере()
	 Выборка = Справочники.РС_КонтактныеЛица.Выбрать();
	 Пока Выборка.Следующий() Цикл 
		 АдресТолько = Истина;
		 Для Каждого СтрокаКИ Из Выборка.КонтактнаяИнформация Цикл
			 Если Не СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда 
				 АдресТолько = Ложь;		
			 КонецЕсли;
		 КонецЦикла;
		 Если АдресТолько Тогда 
			 СправочникОбъект = Выборка.ПолучитьОбъект();
			 СправочникОбъект.ТолькоАдрес = Истина;
			 СправочникОбъект.Записать(); 			 
		 КонецЕсли;	 
	 КонецЦикла;
 КонецПроцедуры

&НаКлиенте
 Процедура УстановитьТолькоАдрес(Команда)
	 УстановитьТолькоАдресНаСервере();
 КонецПроцедуры
