
&НаСервере
Процедура ОбновитьВерсиюКонфигурацииНаСервере()
	 Объект.НазваниеВерсияКонфигурации =  Метаданные.Имя + " " + Метаданные.Версия;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВерсиюКонфигурации(Команда)
	ОбновитьВерсиюКонфигурацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	Объект.рс_Метаданные.Очистить(); 
	
	ЗаполнитьТЧМетаданные("Справочники"); 
    ЗаполнитьТЧМетаданные("Документы");
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧМетаданные(Имя) 
	
	Если Имя = "Справочники" Тогда 
		ИмяДляЗапроса = "Справочник";
	ИначеЕсли Имя = "Документы" Тогда
		ИмяДляЗапроса = "Документ";
	КонецЕсли;	
		
	Для Каждого Метаданное Из Метаданные[Имя] Цикл 
		КоличествоОбъектов = ПолучитьКоличествоОбъектовМетаданных(ИмяДляЗапроса, Метаданное.Имя);
		Если Объект.ПоКоличеству И КоличествоОбъектов = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтрока = Объект.рс_Метаданные.Добавить();
		НовСтрока.Имя 			= Метаданное.Имя;
		НовСтрока.Синоним 		= Метаданное.Синоним; 						
		НовСтрока.ВидОбъекта	= Перечисления.рс_ВидОбъектов[Имя]; 
		НовСтрока.Количество    = КоличествоОбъектов;
		
		ПоискОбъект	 = рс_ОбщийМодульСервер.НайтиОбъектРС(НовСтрока.ВидОбъекта, Метаданное.Имя);  

		Если ЗначениеЗаполнено(ПоискОбъект) Тогда
			
		Иначе  
			Структура = Новый Структура;
			Структура.Вставить("Индентификатор"	, НовСтрока.Имя);
			Структура.Вставить("Наименование"	, НовСтрока.Синоним);  
			Структура.Вставить("Вид" 			, НовСтрока.ВидОбъекта);			
			
			рс_Объект = рс_ОбщийМодульСервер.СоздатьОбъектРС(Структура);   
			
			ПоискОбъект = рс_Объект;
		КонецЕсли;
		
		НовСтрока.рс_Объект	= ПоискОбъект;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоОбъектовМетаданных(ВидМетаданных, ИмяМетаданных)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СпрОбъект.Ссылка) КАК Количество
		|ИЗ
		|	" + ВидМетаданных + "." + ИмяМетаданных + " КАК СпрОбъект";

	Попытка
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Возврат Результат.Количество;
		КонецЕсли;
	Исключение
		Возврат 0;
	КонецПопытки;
	
	Возврат 0;
КонецФункции